```[0m[1maws_iam_role.codepipeline_role: Refreshing state... [id=master-cp-role-bismillah][0m
[0m[1maws_s3_bucket.codepipeline_bucket: Refreshing state... [id=cp-dummy-anjar][0m
[0m[1maws_iam_role.cb_role: Refreshing state... [id=master-cb-role-bismillah][0m
[0m[1maws_s3_bucket.codebuild_bucket: Refreshing state... [id=cb-dummy-anjay][0m
[0m[1maws_codebuild_project.tf_apply: Refreshing state... [id=arn:aws:codebuild:us-east-1:594287454947:project/Terraform_Apply][0m
[0m[1maws_iam_role_policy.cb_policy: Refreshing state... [id=master-cb-role-bismillah:terraform-20210413154605808000000001][0m
[0m[1maws_iam_role_policy.codepipeline_policy: Refreshing state... [id=master-cp-role-bismillah:codepipeline_policy][0m
[0m[1maws_codepipeline.codepipeline: Refreshing state... [id=devterraform-anjar-dummy-master-pipeline][0m

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_codebuild_project.tf_apply[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_codebuild_project" "tf_apply" {
      [32m+[0m [0m[1m[0marn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mbadge_enabled[0m[0m  = false
      [32m+[0m [0m[1m[0mbadge_url[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mbuild_timeout[0m[0m  = 5
      [32m+[0m [0m[1m[0mdescription[0m[0m    = "Project to build and scan a Dummy Terraform"
      [32m+[0m [0m[1m[0mencryption_key[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m           = "Terraform_Apply"
      [32m+[0m [0m[1m[0mqueued_timeout[0m[0m = 480
      [32m+[0m [0m[1m[0mservice_role[0m[0m   = (known after apply)

      [32m+[0m [0martifacts {
          [32m+[0m [0m[1m[0mencryption_disabled[0m[0m    = false
          [32m+[0m [0m[1m[0moverride_artifact_name[0m[0m = false
          [32m+[0m [0m[1m[0mtype[0m[0m                   = "CODEPIPELINE"
        }

      [32m+[0m [0mcache {
          [32m+[0m [0m[1m[0mlocation[0m[0m = "cb-dummy-anjay"
          [32m+[0m [0m[1m[0mtype[0m[0m     = "S3"
        }

      [32m+[0m [0menvironment {
          [32m+[0m [0m[1m[0mcompute_type[0m[0m                = "BUILD_GENERAL1_SMALL"
          [32m+[0m [0m[1m[0mimage[0m[0m                       = "aws/codebuild/amazonlinux2-x86_64-standard:2.0"
          [32m+[0m [0m[1m[0mimage_pull_credentials_type[0m[0m = "CODEBUILD"
          [32m+[0m [0m[1m[0mprivileged_mode[0m[0m             = false
          [32m+[0m [0m[1m[0mtype[0m[0m                        = "LINUX_CONTAINER"
        }

      [32m+[0m [0mlogs_config {
          [32m+[0m [0mcloudwatch_logs {
              [32m+[0m [0m[1m[0mgroup_name[0m[0m  = "log-group"
              [32m+[0m [0m[1m[0mstatus[0m[0m      = "ENABLED"
              [32m+[0m [0m[1m[0mstream_name[0m[0m = "log-stream"
            }

          [32m+[0m [0ms3_logs {
              [32m+[0m [0m[1m[0mencryption_disabled[0m[0m = false
              [32m+[0m [0m[1m[0mlocation[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mstatus[0m[0m              = "ENABLED"
            }
        }

      [32m+[0m [0msource {
          [32m+[0m [0m[1m[0mbuildspec[0m[0m = "buildspec_apply.yml"
          [32m+[0m [0m[1m[0mtype[0m[0m      = "CODEPIPELINE"
        }
    }

[1m  # aws_codepipeline.codepipeline[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_codepipeline" "codepipeline" {
      [32m+[0m [0m[1m[0marn[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m     = "devterraform-anjar-dummy-v2-master-pipeline"
      [32m+[0m [0m[1m[0mrole_arn[0m[0m = (known after apply)

      [32m+[0m [0martifact_store {
          [32m+[0m [0m[1m[0mlocation[0m[0m = "cp-dummy-anjar"
          [32m+[0m [0m[1m[0mregion[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m     = "S3"
        }

      [32m+[0m [0mstage {
          [32m+[0m [0m[1m[0mname[0m[0m = "Source"

          [32m+[0m [0maction {
              [32m+[0m [0m[1m[0mcategory[0m[0m         = "Source"
              [32m+[0m [0m[1m[0mconfiguration[0m[0m    = {
                  [32m+[0m [0m"Branch"     = "master"
                  [32m+[0m [0m"OAuthToken" = "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"
                  [32m+[0m [0m"Owner"      = "anjardanis"
                  [32m+[0m [0m"Repo"       = "github-action"
                }
              [32m+[0m [0m[1m[0mname[0m[0m             = "Source"
              [32m+[0m [0m[1m[0moutput_artifacts[0m[0m = [
                  [32m+[0m [0m"Source-Artifact",
                ]
              [32m+[0m [0m[1m[0mowner[0m[0m            = "ThirdParty"
              [32m+[0m [0m[1m[0mprovider[0m[0m         = "GitHub"
              [32m+[0m [0m[1m[0mregion[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mrun_order[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m          = "1"
            }
        }
      [32m+[0m [0mstage {
          [32m+[0m [0m[1m[0mname[0m[0m = "Build"

          [32m+[0m [0maction {
              [32m+[0m [0m[1m[0mcategory[0m[0m         = "Build"
              [32m+[0m [0m[1m[0mconfiguration[0m[0m    = {
                  [32m+[0m [0m"ProjectName" = "Terraform_Apply"
                }
              [32m+[0m [0m[1m[0minput_artifacts[0m[0m  = [
                  [32m+[0m [0m"Source-Artifact",
                ]
              [32m+[0m [0m[1m[0mname[0m[0m             = "Build"
              [32m+[0m [0m[1m[0moutput_artifacts[0m[0m = [
                  [32m+[0m [0m"Build-Artifact",
                ]
              [32m+[0m [0m[1m[0mowner[0m[0m            = "AWS"
              [32m+[0m [0m[1m[0mprovider[0m[0m         = "CodeBuild"
              [32m+[0m [0m[1m[0mregion[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mrun_order[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m          = "1"
            }
        }
    }

[1m  # aws_iam_role.cb_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "cb_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "codebuild.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "master-cb-role-bismillah"
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_iam_role.codepipeline_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "codepipeline_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "codepipeline.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "master-cp-role-bismillah"
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_iam_role_policy.cb_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "cb_policy" {
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"logs:CreateLogGroup",
                          [32m+[0m [0m"logs:CreateLogStream",
                          [32m+[0m [0m"logs:PutLogEvents",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = [
                          [32m+[0m [0m"*",
                        ]
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"codebuild:*",
                          [32m+[0m [0m"codepipeline:*",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"iam:*",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"ssm:DescribeParameters",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"ssm:GetParameter",
                          [32m+[0m [0m"ssm:GetParameters",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "arn:aws:ssm:us-east-1:594287454947:parameter/*"
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"s3:*",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = [
                          [32m+[0m [0m"*",
                        ]
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mrole[0m[0m   = "master-cb-role-bismillah"
    }

[1m  # aws_iam_role_policy.codepipeline_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "codepipeline_policy" {
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m   = "codepipeline_policy"
      [32m+[0m [0m[1m[0mpolicy[0m[0m = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"s3:GetObject",
                          [32m+[0m [0m"s3:GetObjectVersion",
                          [32m+[0m [0m"s3:GetBucketVersioning",
                          [32m+[0m [0m"s3:PutObject",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = [
                          [32m+[0m [0m"*",
                        ]
                    },
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"codebuild:*",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mrole[0m[0m   = (known after apply)
    }

[1m  # aws_s3_bucket.codebuild_bucket[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket" "codebuild_bucket" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0macl[0m[0m                         = "private"
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "cb-dummy-anjay"
      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)
        }
    }

[1m  # aws_s3_bucket.codepipeline_bucket[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket" "codepipeline_bucket" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0macl[0m[0m                         = "private"
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "cp-dummy-anjar"
      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 8 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```